Revit 2026 API

# FamilyManagerSetDescription Method

---

Set the description for an existing family parameter. The description will be used as tooltip in the Revit UI including in the properties palette.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetDescription(
	FamilyParameter familyParameter,
	string description
)
```
```vb
Public Sub SetDescription (
	familyParameter As FamilyParameter,
	description As String
)
```
```cpp
public:
void SetDescription(
	FamilyParameter^ familyParameter,
	String^ description
)
```
```fsharp
member SetDescription :
        familyParameter : FamilyParameter *
        description : string -> unit
```

#### Parameters

familyParameter FamilyParameter
    The family parameter.
description String
    The description of the family parameter.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| ArgumentException | Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter. |

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace